java/guava.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-06-01 Fri 10:41 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Guava</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Guava</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbebc6ca">1. 基本工具类</a>
<ul>
<li><a href="#orgea10799">1.1. 字符串工具类</a>
<ul>
<li><a href="#org667a4f7">1.1.1. Joiner</a></li>
<li><a href="#orgeebdcc2">1.1.2. Splitter</a>
<ul>
<li><a href="#orgebf68ff">1.1.2.1. 基本工厂方法</a></li>
<li><a href="#org2413f24">1.1.2.2. 修饰方法</a></li>
</ul>
</li>
<li><a href="#orga6954cf">1.1.3. Splitter.MapSplitter</a></li>
<li><a href="#org45bfe29">1.1.4. CharMatcher</a>
<ul>
<li><a href="#org4a250d1">1.1.4.1. 内置工厂方法</a></li>
<li><a href="#orge6504b9">1.1.4.2. 自定义工厂方法</a></li>
<li><a href="#orgffe046b">1.1.4.3. 逻辑运算工厂方法</a></li>
</ul>
</li>
<li><a href="#org7d41c2d">1.1.5. Charsets</a></li>
<li><a href="#org0084401">1.1.6. CaseFormat</a></li>
<li><a href="#org3c1edfb">1.1.7. Strings</a></li>
</ul>
</li>
<li><a href="#org8aa8445">1.2. Stopwatch</a></li>
</ul>
</li>
<li><a href="#orgfc9eba3">2. Collections</a>
<ul>
<li><a href="#orgfc44192">2.1. List</a></li>
<li><a href="#org5dca139">2.2. Map</a></li>
<li><a href="#org92dc7de">2.3. Snippets</a>
<ul>
<li><a href="#org7819777">2.3.1. Filter Nulls</a></li>
<li><a href="#org8af5944">2.3.2. InputStream to byte array</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4c1b4ec">3. IO</a>
<ul>
<li><a href="#org1311804">3.1. Source/Sink</a></li>
<li><a href="#orgc3406af">3.2. Closer</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbebc6ca">1. 基本工具类</a>
<ul>
<li><a href="#orgea10799">1.1. 字符串工具类</a>
<ul>
<li><a href="#org667a4f7">1.1.1. Joiner</a></li>
<li><a href="#orgeebdcc2">1.1.2. Splitter</a></li>
<li><a href="#orga6954cf">1.1.3. Splitter.MapSplitter</a></li>
<li><a href="#org45bfe29">1.1.4. CharMatcher</a></li>
<li><a href="#org7d41c2d">1.1.5. Charsets</a></li>
<li><a href="#org0084401">1.1.6. CaseFormat</a></li>
<li><a href="#org3c1edfb">1.1.7. Strings</a></li>
</ul>
</li>
<li><a href="#org8aa8445">1.2. Stopwatch</a></li>
</ul>
</li>
<li><a href="#orgfc9eba3">2. Collections</a>
<ul>
<li><a href="#orgfc44192">2.1. List</a></li>
<li><a href="#org5dca139">2.2. Map</a></li>
<li><a href="#org92dc7de">2.3. Snippets</a>
<ul>
<li><a href="#org7819777">2.3.1. Filter Nulls</a></li>
<li><a href="#org8af5944">2.3.2. InputStream to byte array</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4c1b4ec">3. IO</a>
<ul>
<li><a href="#org1311804">3.1. Source/Sink</a></li>
<li><a href="#orgc3406af">3.2. Closer</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Author</td>
<td class="org-left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="org-left">Date</td>
<td class="org-left">2018-06-01 10:41:27</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-orgbebc6ca" class="outline-2">
<h2 id="orgbebc6ca"><span class="section-number-2">1</span> 基本工具类</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgea10799" class="outline-3">
<h3 id="orgea10799"><span class="section-number-3">1.1</span> 字符串工具类</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org667a4f7" class="outline-4">
<h4 id="org667a4f7"><span class="section-number-4">1.1.1</span> <a href="https://github.com/google/guava/wiki/StringsExplained#joiner">Joiner</a></h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">String</span>[] <span style="color: #0087ff;">strList</span> = {<span style="color: #00afaf;">"a"</span>, <span style="color: #00afaf;">"b"</span>, <span style="color: #00afaf;">"c"</span>, <span style="color: #00afaf;">null</span>, <span style="color: #00afaf;">"d"</span>, <span style="color: #00afaf;">"e"</span>, <span style="color: #00afaf;">null</span>, <span style="color: #00afaf;">null</span>};
Joiner.on(<span style="color: #00afaf;">"|"</span>).skipNulls().join(strList);      <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">a|b|c|d|e</span>
Joiner.on(<span style="color: #00afaf;">"|"</span>).useForNull(<span style="color: #00afaf;">"NA"</span>).join(strList); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">a|b|c|NA|d|e|NA|NA</span>

Joiner.on(<span style="color: #00afaf;">"#"</span>).withKeyValueSeparator(<span style="color: #00afaf;">"="</span>).join(strMap);
</pre>
</div>
</div>
</div>


<div id="outline-container-orgeebdcc2" class="outline-4">
<h4 id="orgeebdcc2"><span class="section-number-4">1.1.2</span> <a href="https://github.com/google/guava/wiki/StringsExplained#splitter">Splitter</a></h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-java">Splitter.on(<span style="color: #00afaf;">','</span>).trimResults().omitEmptyStrings().split(<span style="color: #00afaf;">"foo,bar,,   qux"</span>);
Splitter.on(<span style="color: #00afaf;">','</span>).omitEmptyStrings().split(<span style="color: #00afaf;">"a,,c,d"</span>); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">"a", "c", "d"</span>
Splitter.on(<span style="color: #00afaf;">','</span>).trimResults().split(<span style="color: #00afaf;">"a, b, c, d"</span>); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">"a", "b", "c", "d"</span>
Splitter.on(<span style="color: #00afaf;">','</span>).trimResults(CharMatcher.is(<span style="color: #00afaf;">'_'</span>)).split(<span style="color: #00afaf;">"_a ,_b_ ,c__"</span>); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">"a", "b_", "c"</span>
Splitter.on(<span style="color: #00afaf;">','</span>).limit(3).split(<span style="color: #00afaf;">"a,b,c,d"</span>); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">"a", "b", "c,d"</span>
</pre>
</div>
</div>

<div id="outline-container-orgebf68ff" class="outline-5">
<h5 id="orgebf68ff"><span class="section-number-5">1.1.2.1</span> 基本工厂方法</h5>
<div class="outline-text-5" id="text-1-1-2-1">
<ul class="org-ul">
<li>Splitter.on(char)</li>
<li>Splitter.on(CharMatcher)</li>
<li>Splitter.on(String)</li>
<li>Splitter.on(Patter)</li>
<li>Splitter.fixedLength(int)</li>
</ul>
</div>
</div>

<div id="outline-container-org2413f24" class="outline-5">
<h5 id="org2413f24"><span class="section-number-5">1.1.2.2</span> 修饰方法</h5>
<div class="outline-text-5" id="text-1-1-2-2">
<ul class="org-ul">
<li>omitEmptyStrings()</li>
<li>trimResults() , 即 <code>trimResults(CharMatcher.WHITESPACE)</code></li>
<li>trimResults(CharMatcher)</li>
<li>limit(int)</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orga6954cf" class="outline-4">
<h4 id="orga6954cf"><span class="section-number-4">1.1.3</span> <a href="https://google.github.io/guava/releases/23.0/api/docs/com/google/common/base/Splitter.MapSplitter.html">Splitter.MapSplitter</a></h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">
<pre class="src src-java">Splitter.on(<span style="color: #00afaf;">';'</span>).trimResults().withKeyValueSeparator(<span style="color: #00afaf;">"=&gt;"</span>).split(<span style="color: #00afaf;">"a=&gt;b ; c=&gt;b"</span>);
<span style="color: #585858; font-style: italic;">/*</span>
<span style="color: #585858; font-style: italic;">  {</span>
<span style="color: #585858; font-style: italic;">    "a": "b",</span>
<span style="color: #585858; font-style: italic;">    "c": "b"</span>
<span style="color: #585858; font-style: italic;">  }</span>
<span style="color: #585858; font-style: italic;">*/</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org45bfe29" class="outline-4">
<h4 id="org45bfe29"><span class="section-number-4">1.1.4</span> <a href="https://github.com/google/guava/wiki/StringsExplained#charmatcher">CharMatcher</a></h4>
<div class="outline-text-4" id="text-1-1-4">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">String</span> <span style="color: #0087ff;">noControl</span> = CharMatcher.javaIsoControl().removeFrom(string); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">remove control characters</span>
<span style="color: #af8700;">String</span> <span style="color: #0087ff;">theDigits</span> = CharMatcher.digit().retainFrom(string); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">only the digits</span>
<span style="color: #af8700;">String</span> <span style="color: #0087ff;">spaced</span> = CharMatcher.whitespace().trimAndCollapseFrom(string, <span style="color: #00afaf;">' '</span>);
<span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">trim whitespace at ends, and replace/collapse whitespace into single spaces</span>
<span style="color: #af8700;">String</span> <span style="color: #0087ff;">noDigits</span> = CharMatcher.javaDigit().replaceFrom(string, <span style="color: #00afaf;">"*"</span>); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">star out all digits</span>
<span style="color: #af8700;">String</span> <span style="color: #0087ff;">lowerAndDigit</span> = CharMatcher.javaDigit().or(CharMatcher.javaLowerCase()).retainFrom(string);
<span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">eliminate all characters that aren't digits or lowercase</span>
</pre>
</div>
</div>

<div id="outline-container-org4a250d1" class="outline-5">
<h5 id="org4a250d1"><span class="section-number-5">1.1.4.1</span> 内置工厂方法</h5>
<div class="outline-text-5" id="text-1-1-4-1">
<ul class="org-ul">
<li>any()</li>
<li>none()</li>
<li>whitespace()</li>
<li>breakingWhitespace()</li>
<li>invisible()</li>
<li>digit()</li>
<li>javaLetter()</li>
<li>javaDigit()</li>
<li>javaLetterOrDigit()</li>
<li>javaIsoControl()</li>
<li>javaLowerCase()</li>
<li>javaUpperCase()</li>
<li>ascii()</li>
<li>singleWidth()</li>
</ul>
</div>
</div>

<div id="outline-container-orge6504b9" class="outline-5">
<h5 id="orge6504b9"><span class="section-number-5">1.1.4.2</span> 自定义工厂方法</h5>
<div class="outline-text-5" id="text-1-1-4-2">
<ul class="org-ul">
<li>anyOf(CharSequence)</li>
<li>is(char)</li>
<li>inRange(char, char)</li>
</ul>
</div>
</div>

<div id="outline-container-orgffe046b" class="outline-5">
<h5 id="orgffe046b"><span class="section-number-5">1.1.4.3</span> 逻辑运算工厂方法</h5>
<div class="outline-text-5" id="text-1-1-4-3">
<ul class="org-ul">
<li>negate()</li>
<li>and(CharMatcher)</li>
<li>or(CharMatcher)</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org7d41c2d" class="outline-4">
<h4 id="org7d41c2d"><span class="section-number-4">1.1.5</span> Charsets</h4>
</div>

<div id="outline-container-org0084401" class="outline-4">
<h4 id="org0084401"><span class="section-number-4">1.1.6</span> CaseFormat</h4>
<div class="outline-text-4" id="text-1-1-6">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Format</td>
<td class="org-left">Example</td>
</tr>

<tr>
<td class="org-left">LOWER_CAMEL</td>
<td class="org-left">lowerCamel</td>
</tr>

<tr>
<td class="org-left">LOWER_HYPHEN</td>
<td class="org-left">lower-hyphen</td>
</tr>

<tr>
<td class="org-left">LOWER_UNDERSCORE</td>
<td class="org-left">lower_underscore</td>
</tr>

<tr>
<td class="org-left">UPPER_CAMEL</td>
<td class="org-left">UpperCamel</td>
</tr>

<tr>
<td class="org-left">UPPER_UNDERSCORE</td>
<td class="org-left">UPPER_UNDERSCORE</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00afaf;">CaseFormat</span>.UPPER_UNDERSCORE.to(<span style="color: #00afaf;">CaseFormat</span>.LOWER_CAMEL, <span style="color: #00afaf;">"CONSTANT_NAME"</span>));
<span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">returns "constantName"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3c1edfb" class="outline-4">
<h4 id="org3c1edfb"><span class="section-number-4">1.1.7</span> Strings</h4>
<div class="outline-text-4" id="text-1-1-7">
<div class="org-src-container">
<pre class="src src-java">Strings.padEnd(<span style="color: #00afaf;">"foo"</span>, 6, <span style="color: #00afaf;">'x'</span>);  <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">fooxxx</span>

Strings.nullToEmpty(<span style="color: #00afaf;">""</span>);        <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">""</span>
Strings.nullToEmpty(<span style="color: #00afaf;">null</span>);      <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">""</span>
Strings.nullToEmpty(<span style="color: #00afaf;">"hello"</span>);   <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">"hello"</span>

Strings.emptyToNull(<span style="color: #00afaf;">""</span>);        <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">null</span>
Strings.emptyToNull(<span style="color: #00afaf;">null</span>);      <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">null</span>
Strings.emptyToNull(<span style="color: #00afaf;">"hello"</span>);   <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">"hello"</span>

Strings.isNullOrEmpty(<span style="color: #00afaf;">null</span>);    <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">true</span>
Strings.isNullOrEmpty(<span style="color: #00afaf;">""</span>);      <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">true</span>
Strings.isNullOrEmpty(<span style="color: #00afaf;">"hello"</span>); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">false</span>
</pre>
</div>

<ul class="org-ul">
<li>commonPrefix(CharSequence a, CharSequence b) (公共前缀)</li>
<li>commonSuffix(CharSequence a, CharSequence b) (公共后缀)</li>
<li>emptyToNull(String)</li>
<li>isNullOrEmpty(String)</li>
<li>nullToEmpty(String)</li>
<li>padEnd(String s, int minLength, char padChar)</li>
<li>padStart(String s, int minLength, char padChar)</li>
<li>repeat(String s, int count)</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org8aa8445" class="outline-3">
<h3 id="org8aa8445"><span class="section-number-3">1.2</span> <a href="https://google.github.io/guava/releases/23.0/api/docs/com/google/common/base/Stopwatch.html">Stopwatch</a></h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">Stopwatch</span> <span style="color: #0087ff;">stopwatch</span> = Stopwatch.createStarted();
doSomething();
stopwatch.stop(); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">optional</span>

<span style="color: #af8700;">Duration</span> <span style="color: #0087ff;">duration</span> = stopwatch.elapsed();

log.info(<span style="color: #00afaf;">"time: "</span> + stopwatch); <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">formatted string like "12.3 ms"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfc9eba3" class="outline-2">
<h2 id="orgfc9eba3"><span class="section-number-2">2</span> Collections</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgfc44192" class="outline-3">
<h3 id="orgfc44192"><span class="section-number-3">2.1</span> List</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">ImmutableList</span>&lt;<span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">of</span> = ImmutableList.of(<span style="color: #00afaf;">"a"</span>, <span style="color: #00afaf;">"b"</span>, <span style="color: #00afaf;">"c"</span>, <span style="color: #00afaf;">"d"</span>);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">List</span>&lt;<span style="color: #af8700;">ToClass</span>&gt; <span style="color: #0087ff;">toList</span> = Lists.transform(fromList, <span style="color: #5f8700;">new</span> <span style="color: #af8700;">Function</span>&lt;<span style="color: #af8700;">FromClass</span>, <span style="color: #af8700;">ToClass</span>&gt;() {
    <span style="color: #00afaf;">@Override</span>
    <span style="color: #5f8700;">public</span> <span style="color: #af8700;">ToClass</span> <span style="color: #0087ff;">apply</span>(<span style="color: #af8700;">FromClass</span> <span style="color: #0087ff;">from</span>) {
        <span style="color: #af8700;">ToClass</span> <span style="color: #0087ff;">to</span> = <span style="color: #5f8700;">new</span> <span style="color: #af8700;">ToClass</span>();
        to.setX(from.getX());
        to.setY(from.getY());
        to.setZ(from.getZ());
        <span style="color: #5f8700;">return</span> to;
    }});
</pre>
</div>
</div>
</div>


<div id="outline-container-org5dca139" class="outline-3">
<h3 id="org5dca139"><span class="section-number-3">2.2</span> Map</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">ImmutableMap</span>&lt;<span style="color: #af8700;">String</span>,<span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">map</span> = ImmutableMap.of(<span style="color: #00afaf;">"key1"</span>, <span style="color: #00afaf;">"value1"</span>, <span style="color: #00afaf;">"key2"</span>, <span style="color: #00afaf;">"value2"</span>);
</pre>
</div>
</div>
</div>


<div id="outline-container-org92dc7de" class="outline-3">
<h3 id="org92dc7de"><span class="section-number-3">2.3</span> Snippets</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org7819777" class="outline-4">
<h4 id="org7819777"><span class="section-number-4">2.3.1</span> Filter Nulls</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">Iterable</span>&lt;<span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">filterStrings</span> = Iterables.filter(values, Predicates.notNull());
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">List</span>&lt;<span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">filterStrings</span> = FluentIterable.from(origins).filter(Predicates.notNull()).toList();
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">Collection</span>&lt;<span style="color: #af8700;">String</span>&gt; <span style="color: #0087ff;">filterStrings</span> = Collections2.filter(valuse, Predicates.notNull());
</pre>
</div>
</div>
</div>


<div id="outline-container-org8af5944" class="outline-4">
<h4 id="org8af5944"><span class="section-number-4">2.3.2</span> InputStream to byte array</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
<code>byte[] bytes = ByteStreams.toByteArray(inputStream);</code>
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org4c1b4ec" class="outline-2">
<h2 id="org4c1b4ec"><span class="section-number-2">3</span> IO</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org1311804" class="outline-3">
<h3 id="org1311804"><span class="section-number-3">3.1</span> <a href="https://github.com/google/guava/wiki/IOExplained#io-utilities">Source/Sink</a></h3>
</div>

<div id="outline-container-orgc3406af" class="outline-3">
<h3 id="orgc3406af"><span class="section-number-3">3.2</span> <a href="https://google.github.io/guava/releases/23.0/api/docs/com/google/common/io/Closer.html">Closer</a></h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #af8700;">Closer</span> <span style="color: #0087ff;">closer</span> = Closer.create();
<span style="color: #5f8700;">try</span> {
    <span style="color: #af8700;">InputStream</span> <span style="color: #0087ff;">in</span> = closer.register(openInputStream());
    <span style="color: #af8700;">OutputStream</span> <span style="color: #0087ff;">out</span> = closer.register(openOutputStream());
    <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">do stuff</span>
} <span style="color: #5f8700;">catch</span> (<span style="color: #af8700;">Throwable</span> <span style="color: #0087ff;">e</span>) {
    <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">ensure that any checked exception types other than IOException that could be thrown are</span>
    <span style="color: #585858; font-style: italic;">// </span><span style="color: #585858; font-style: italic;">provided here, e.g. throw closer.rethrow(e, CheckedException.class);</span>
    <span style="color: #5f8700;">throw</span> closer.rethrow(e);
} <span style="color: #5f8700;">finally</span> {
    closer.close();
}
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>